2021_Summer/examples/onera_m6/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.3.1                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object blockMeshDict;
}

L1 20;
L2 -20;
N 20;
M 10;

convertToMeters 1;

vertices  
(
    ($L2 $L2  0)
    ($L1 $L2  0)
    ($L1 $L1  0)
    ($L2 $L1  0)
    ($L2 $L2  $L1)
    ($L1 $L2  $L1)
    ($L1 $L1  $L1)
    ($L2 $L1  $L1)
);

blocks  
(
    hex ( 0 1 2 3 4 5 6 7) ($N $N $M) simpleGrading (1 1 1)
);

edges  
(
);

patches  
( 
  patch farfield_inlet
  (
      (0 4 7 3)
  ) 
  patch farfield_outlet
  (
      (1 2 6 5)
  ) 
  patch farfield_bot
  (
      (0 1 5 4)
  ) 
  patch farfield_top
  (
      (3 7 6 2)
  ) 
  symmetry sym
  (
      (0 3 2 1)
  ) 
  patch farfield_front
  (
      (4 5 6 7)
  )
);

mergePatchPairs  
(
);
